<P> <img src="https://i.ibb.co/gyNf19D/nhslogo.png" alt="nhslogo" border="0" width="100" align="right"><font size="6"><b> CS6131 Database Design</b> </font>

# Lab 4

## Question 1: More Complex SQL

### Connecting to the Database

In [2]:
%load_ext sql

In [3]:
%sql mysql+pymysql://root:admin@localhost/

In [4]:
# PrettyTable dependancy has deprecated the default style so needs to be explicitly configured
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

We are using the same company database from the previous lab. You need not reload the database if the database has been created properly in the last lab.

Run the query below to check that the data has been loaded correctly.

In [5]:
%%sql
use company;
Select * from department;

 * mysql+pymysql://root:***@localhost/
0 rows affected.
7 rows affected.

[('Headquarters', 1, '888665555', datetime.date(1971, 6, 19)),
 ('Administration', 4, '987654321', datetime.date(1985, 1, 1)),
 ('Research', 5, '333445555', datetime.date(1978, 5, 22)),
 ('Software', 6, '111111100', datetime.date(1999, 5, 15)),
 ('Hardware', 7, '444444400', datetime.date(1998, 5, 15)),
 ('Sales', 8, '555555500', datetime.date(1997, 1, 1)),
 ('Test', 10, '555555500', None)]

#### a) Find the max, min, average salary of all employees.

In [6]:
%%sql
SELECT MAX(salary) as max, MIN(salary) as min, AVG(salary) as average
FROM employee;

 * mysql+pymysql://root:***@localhost/
1 rows affected.

[(Decimal('96000.00'), Decimal('25000.00'), Decimal('49175.000000'))]

#### b) Retrieve the total number of employees in the 'Research' department.

In [7]:
%%sql
SELECT COUNT(*) as count
FROM employee
where dno = (
    SELECT dnumber
    FROM department
    WHERE dname = 'Research'
);

 * mysql+pymysql://root:***@localhost/
1 rows affected.

[(4,)]

#### c) Find the total number of hours all employees spent on the project number 61.

In [8]:
%%sql
SELECT SUM(hours) as 'Total hours'
FROM works_on
WHERE pno = 61;

 * mysql+pymysql://root:***@localhost/
1 rows affected.

[(Decimal('350.0'),)]

#### d) For each department, retrieve the department name, the number of employees in the department, and their average salary.

In [9]:
%%sql
SELECT dname, COUNT(ssn) as 'Number of employees', AVG(salary) as 'Average salary'
FROM employee, department
WHERE dno = dnumber
GROUP BY dno

 * mysql+pymysql://root:***@localhost/
6 rows affected.

[('Headquarters', 1, Decimal('55000.000000')),
 ('Administration', 3, Decimal('31000.000000')),
 ('Research', 4, Decimal('33250.000000')),
 ('Software', 8, Decimal('60000.000000')),
 ('Hardware', 10, Decimal('63450.000000')),
 ('Sales', 14, Decimal('40821.428571'))]

#### e) For each department with more than 5 employees, retrieve the department name, the number of employees in the department, and their average salary.

In [10]:
%%sql
SELECT dname, COUNT(ssn) as 'Number of employees', AVG(salary) as 'Average salary'
FROM employee, department
WHERE dno = dnumber
GROUP BY dno
HAVING COUNT(ssn) > 5

 * mysql+pymysql://root:***@localhost/
3 rows affected.

[('Software', 8, Decimal('60000.000000')),
 ('Hardware', 10, Decimal('63450.000000')),
 ('Sales', 14, Decimal('40821.428571'))]

#### f) For each department with a total salary of more than 100k, retrieve the department name, the number of employees in the department, their average salary and the total salary.

In [11]:
%%sql
SELECT dname, COUNT(ssn) as 'Number of employees', AVG(salary) as 'Average salary', SUM(salary) as 'Total salary'
FROM employee, department
WHERE dno = dnumber
GROUP BY dno
HAVING SUM(salary) > 100000

 * mysql+pymysql://root:***@localhost/
4 rows affected.

[('Research', 4, Decimal('33250.000000'), Decimal('133000.00')),
 ('Software', 8, Decimal('60000.000000'), Decimal('480000.00')),
 ('Hardware', 10, Decimal('63450.000000'), Decimal('634500.00')),
 ('Sales', 14, Decimal('40821.428571'), Decimal('571500.00'))]

#### g) For each department, list the department name, total number of employees, total number of males and percentage of male in the department.

In [12]:
%%sql
SELECT dname, COUNT(ssn) as 'Number of employees', COUNT(CASE WHEN sex = 'M' THEN 1 END) as 'Number of males', COUNT(CASE WHEN sex = 'M' THEN 1 END) / COUNT(ssn) * 100 as 'Percentage of males'
FROM employee, department
WHERE dno = dnumber
GROUP BY dno

 * mysql+pymysql://root:***@localhost/
6 rows affected.

[('Headquarters', 1, 1, Decimal('100.0000')),
 ('Administration', 3, 1, Decimal('33.3333')),
 ('Research', 4, 3, Decimal('75.0000')),
 ('Software', 8, 7, Decimal('87.5000')),
 ('Hardware', 10, 7, Decimal('70.0000')),
 ('Sales', 14, 10, Decimal('71.4286'))]

#### h)
Assuming that we would like to count the total number of employees whose salaries exceed $40,000 in each department, but only for departments where more than five employees work. Explain why the following query will not achieve the desired results. 

<pre>SELECT 	DNAME, COUNT(*)
FROM 		DEPARTMENT, EMPLOYEE
WHERE 	DNUMBER=DNO AND SALARY>40000
GROUP BY	DNAME
HAVING 	COUNT(*)>5 </pre>

### The last line checks if each department has more than 5 employees that have a salary exceeding 40k instead of checking whether each department has more than 5 employees working there.

Hence, write the query to achieve the desired results.

In [13]:
%%sql
SELECT dname, COUNT(CASE WHEN salary > 40000 THEN 1 END) as 'Employee over 40k salary count'
FROM department, employee
WHERE dnumber=dno
GROUP BY dno
HAVING COUNT(*) > 5

 * mysql+pymysql://root:***@localhost/
3 rows affected.

[('Software', 7), ('Hardware', 10), ('Sales', 5)]

#### i) For each supervisor, list the supervisor’s last name, his ssn and the number of supervisees under him.

In [14]:
%%sql
SELECT m.lname, m.ssn, COUNT(*) as 'Number of supervisees'
FROM employee s, employee m
WHERE m.ssn = s.superssn
GROUP BY m.ssn

 * mysql+pymysql://root:***@localhost/
17 rows affected.

[('James', '111111100', 3),
 ('Knight', '111111103', 7),
 ('Wallis', '222222200', 3),
 ('Zell', '222222201', 2),
 ('Grace', '333333300', 4),
 ('Freed', '444444400', 3),
 ('James', '555555500', 1),
 ('Bender', '666666600', 2),
 ('Jarvis', '666666601', 1),
 ('King', '666666602', 3),
 ('Leslie', '666666603', 2),
 ('King', '666666604', 1),
 ('Small', '666666607', 1),
 ('Drew', '666666610', 1),
 ('Reedy', '666666611', 1),
 ('Hall', '666666612', 1),
 ('Borg', '888665555', 3)]

#### j) List the names of all supervisors with more than 2 supervisees.

In [15]:
%%sql
SELECT m.lname, m.ssn, COUNT(*) as 'Number of supervisees'
FROM employee s, employee m
WHERE m.ssn = s.superssn
GROUP BY m.ssn
HAVING COUNT(*) > 2

 * mysql+pymysql://root:***@localhost/
7 rows affected.

[('James', '111111100', 3),
 ('Knight', '111111103', 7),
 ('Wallis', '222222200', 3),
 ('Grace', '333333300', 4),
 ('Freed', '444444400', 3),
 ('King', '666666602', 3),
 ('Borg', '888665555', 3)]

#### k) List the average number of hours the employees spent on for each project and the name of the project.

In [16]:
%%sql
SELECT pname, AVG(hours) as 'Avg number of hours'
FROM works_on, project
WHERE pnumber=pno
GROUP BY pno

 * mysql+pymysql://root:***@localhost/
11 rows affected.

[('ProductX', Decimal('26.25000')),
 ('ProductY', Decimal('12.50000')),
 ('ProductZ', Decimal('25.00000')),
 ('Computerization', Decimal('18.33333')),
 ('Reorganization', Decimal('12.50000')),
 ('Newbenefits', Decimal('18.33333')),
 ('OperatingSystems', Decimal('38.88889')),
 ('DatabaseSystems', Decimal('37.25000')),
 ('Middleware', Decimal('34.00000')),
 ('InkjetPrinters', Decimal('40.00000')),
 ('LaserPrinters', Decimal('41.33333'))]

#### l) Calculate the total number of hours the employees spent on for the projects controlled by each department.

In [17]:
%%sql
SELECT dnum, SUM(hours) as 'Total number of hours'
FROM works_on, project
WHERE pnumber=pno
GROUP BY dnum

 * mysql+pymysql://root:***@localhost/
5 rows affected.

[(1, Decimal('25.0')),
 (4, Decimal('110.0')),
 (5, Decimal('140.0')),
 (6, Decimal('784.0')),
 (7, Decimal('444.0'))]

#### m) Run the following query. Observe the result and explain what the query does.

<pre>
SELECT 	TMP.DNAME, TMP.NUMMALE
FROM 		(	SELECT 	DNAME, COUNT(SEX) NUMMALE
			FROM	 	EMPLOYEE, DEPARTMENT
			WHERE 	SEX="M" AND DNO=DNUMBER
			GROUP BY	DNAME) TMP
WHERE 	TMP.NUMMALE < 3
</pre>

In [18]:
%%sql
SELECT 	TMP.DNAME, TMP.NUMMALE
FROM 		(	SELECT 	DNAME, COUNT(SEX) NUMMALE
			FROM	 	EMPLOYEE, DEPARTMENT
			WHERE 	SEX="M" AND DNO=DNUMBER
			GROUP BY	DNAME) TMP
WHERE 	TMP.NUMMALE < 3

 * mysql+pymysql://root:***@localhost/
2 rows affected.

[('Headquarters', 1), ('Administration', 1)]

#### It is showing the departments with fewer than 3 males and the number of males in those departments

<font color='red'>**Before your submit, please make sure to click Kernel > Restart & Run All so that the output is shown.**</font>

## Question 2: Case Function

The `CASE` statement goes through conditions and return a value when the first condition is met (like an IF-THEN-ELSE statement)

Read more about the CASE statement and how to use it at https://www.w3schools.com/SQL/func_mysql_case.asp

After understanding how the function works, shortlist a suitable query which uses CASE. State your query below, and complete the SQL statement required to answer the query.

#### Write down your query here.

In [ ]:
%%sql
-- Bin employees based on salary into 3 bins (<50k, 50k-75k, >75k)
SELECT CONCAT(fname, ' ', minit, ' ', lname) as name, ssn,
CASE WHEN salary > 0 AND salary <= 50000 THEN 1
WHEN salary > 50000 AND salary <= 75000 THEN 2
WHEN salary > 75000 THEN 3 END as salary_bin
FROM employee

 * mysql+pymysql://root:***@localhost/
40 rows affected.

[('Jared D James', '111111100', 3),
 ('Jon C Jones', '111111101', 1),
 ('Justin n Mark', '111111102', 1),
 ('Brad C Knight', '111111103', 1),
 ('John B Smith', '123456789', 1),
 ('Evan E Wallis', '222222200', 3),
 ('Josh U Zell', '222222201', 2),
 ('Andy C Vile', '222222202', 2),
 ('Tom G Brand', '222222203', 2),
 ('Jenny F Vos', '222222204', 2),
 ('Chris A Carter', '222222205', 1),
 ('Kim C Grace', '333333300', 3),
 ('Jeff H Chase', '333333301', 1),
 ('Franklin T Wong', '333445555', 1),
 ('Alex D Freed', '444444400', 3),
 ('Bonnie S Bays', '444444401', 2),
 ('Alec C Best', '444444402', 2),
 ('Sam S Snedden', '444444403', 1),
 ('Joyce A English', '453453453', 1),
 ('John C James', '555555500', 3),
 ('Nandita K Ball', '555555501', 2),
 ('Bob B Bender', '666666600', 3),
 ('Jill J Jarvis', '666666601', 1),
 ('Kate W King', '666666602', 1),
 ('Lyle G Leslie', '666666603', 1),
 ('Billie J King', '666666604', 1),
 ('Jon A Kramer', '666666605', 1),
 ('Ray H King', '666666606', 1),
 ('Gerald D Small', '666666607', 1),
 ('Arnold A Head', '666666608', 1),
 ('Helga C Pataki', '666666609', 1),
 ('Naveen B Drew', '666666610', 1),
 ('Carl E Reedy', '666666611', 1),
 ('Sammy G Hall', '666666612', 1),
 ('Red A Bacher', '666666613', 1),
 ('Ramesh K Narayan', '666884444', 1),
 ('James E Borg', '888665555', 2),
 ('Jennifer S Wallace', '987654321', 1),
 ('Ahmad V Jabbar', '987987987', 1),
 ('Alicia J Zelaya', '999887777', 1)]

### Submission Instructions

<div class="alert alert-block alert-info">
    
#### Upload to Coursemology

Upload the `.ipynb` to Coursemology. Name the file in the following format: `Lab<num><YourName>.ipynb`.

#### Print to OneNote

Print the `.ipynb` to OneNote > Individual Student Space > Lab folder
    
</div>

<hr>
© NUS High School of Math & Science